## Creatre a database Using SQLite

In [3]:
import sqlite3

In [6]:
#make a connection object
connection = sqlite3.connect('INSTRUCTOR.db')

In [11]:
#create a cursor object
#it is an instance using when we can invoke methods to execute SQLite statements
#such as fetch data from the result sets of the queries

cursorObj = connection.cursor()

## Create a table in the Database

In this step we will create a table in the database with following details:

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/images/table.png" align="center">

In [13]:
#first, we need to check if the table alr exist or not
#to drop the table from database, use DROP query

#Drop the table if it alr exist
cursorObj.execute("Drop Table if Exists Instructor")

In [17]:
#create a table, by assign the statement into table objects
table = """create table if not exists instructor(id integer primary key not null, fname varchar(20), lname varchar(20), city varchar(20), ccode char(2));"""

#next, send the parameter to create the database object
cursorObj.execute(table)

print ("Table is ready")

Table is ready

## Insert data into the table

The INSTRUCTOR table we created in the previous step contains 3 rows of data:

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/images/table1.png" align="center">

In [18]:
#insert the first row value
cursorObj.execute("""insert into instructor values(1, 'Rav','Ahuja','TORONTO','CA');""")

In [22]:
#insert the second row value
cursorObj.execute('''insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

## Query Data in the Table

In [25]:
#we will retrieve all of the data from sql that we create in statement object
statement = """SELECT * FROM INSTRUCTOR"""
cursorObj.execute(statement)

#next we will convert the retrieved data to python, by .fetchall syntax
print ("All the Instructor Data: ")
#create a list to retrieve the fetched sql databases
output = cursorObj.fetchall()

i = 1
for rows in output:
    print ("rows",i,":",rows)
    i += 1

All the Instructor Data:
rows 1 : (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
rows 2 : (2, 'Raul', 'Chong', 'Markham', 'CA')
rows 3 : (3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [26]:
#fetch only fname from the table
statement = """SELECT FNAME FROM INSTRUCTOR"""
cursorObj.execute(statement)

print ("First Name Data: ")
output = cursorObj.fetchall()
for row in output:
    print (row)

First Name Data:
('Rav',)
('Raul',)
('Hima',)

In [30]:
#update statements
update = """update instructor set city = 'MOOSETOWN' where fname = 'Rav'"""
cursorObj.execute(update)

#select all to display
statement = """select * from instructor"""
cursorObj.execute(statement)

print ("All the updated data: ")
output = cursorObj.fetchmany(2)

for row in output:
    print(row)

All the updated data:
(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

## Retrieve data into Pandas

In [31]:
import pandas as pd

#retrieve the query results into a pandas dataframe
df = pd.read_sql_query("select * from instructor",connection)

df

   id fname      lname       city ccode
0   1   Rav      Ahuja  MOOSETOWN    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

## Close the connection

In [33]:
connection.close()